#explicit არის ხელით მიერ შეცვლა ხოლო implicit არის ავტომატურად შეცვლა
age = int(input("შეიყვანეთ თქვენი ასაკი: "))
print("10 წელში თქვენ იქნებით:", age + 10)

პირველ კოდში გამოიტანს 2



მეორე კოდის შედეგი იქნება -16


#1 str("") თვითონ რიცხვს ტექსტად აქცევს
#2 int() ტექსტს მთელ რიცხვად აქცესტ
#3 მერე მოდის ტექსტის გამრავლება *
#4 მერე true and fqalse  print(0-22+1+int(float("5)))
#5 float-ს ათწილად  რიცხვად გადაგვყავს ანუ float("5")=5.0
#6 mere in(5.0)=5 ანყ დავამრგვალეთ
#7 ბოლო შეჯამება  0-22=-22
-22+1+-21
_21+5+-16