# 1) ახსენით რა არის input და output

# input არის შემავალი ინფორმაცია, ანუ როდესაც რაღაცა შემოგვავს, ხოლო output არის პასუხი, ანუ გამომავალი ინფორმაცია
# 2) მომხმარებელს შემოატანინე სახელი და გამოიტანე

name = input('Enter your name')

print(name)

# 3)რას გამოიტანს კოდი print(int("24") + 23)

# კოდი გამოიტანეს 47-ს

# 4)შექმენი ორი ცვლადი სადაც შეინახავ შენს სახელსა და გვარს, შემდეგ კი კონკატინაციის საშუალებით დაპრინტე ისინი ერთად

my_name = 'Davit'
surname = 'Shavidze'

print(my_name + " " + surname)

# 5)გადახედეთ ჩანაწერს და ჩაასწორეთ საკლასოები

# done

